### Objectives
YWBAT 
* design OOPs to optimize tasks

# Creating an ORM
ORMs are ways for us to interact with dbs using python (in our case). You can build them with other languages though such as javascript, scala, etc. 

To start building an ORM, open the my_class.py file
* Create a class called MyDatabase
* Then create an init method that takes in the connection information of your class
    * in other words when you instantiate your object you should be able to connect to your database
* Create methods for your class to
    * query the tables in your database
    * query all the information for a given table
    * query the columns of a table
* After this create a child class called Customers
* Create methods to
    * query all the information from the Customers class (but ideally this should be inherited from your parent class, so you really don't have to do this)
    * query specific customers given a column and a value (you can pick)
    * create your own function specific to the customers table
* Create another class for a given table and write at least 3 methods

### Outline
* Connect to our DB in Jupyter
* Run some queries
* Translate those queries/connections into a class object
* Build out our class object as we need more functionality
* Build child classes using our parent class

Use Jupyter to import your file and test your methods

Example

```python
my_db = MyDatabase(params)
my_db.list_tables()
```

In [2]:
import sqlite3
import numpy as np

import pandas as pd
from importlib import reload

```
Object
    |-Attributes
    |-Methods
```

In [3]:
conn = sqlite3.Connection("data.sqlite")

In [9]:
# list all of our tables in the database

def get_table_names(conn):
    query = "select name from sqlite_master where type='table'"

    res = conn.execute(query).fetchall()
    table_names = [r[0] for r in res]
    return table_names

get_table_names(conn)

['orderdetails',
 'payments',
 'offices',
 'customers',
 'orders',
 'productlines',
 'products',
 'employees',
 'contacts',
 'contacts2']

In [187]:
import DataConnector as dc
reload(dc) # refreshes the file in memory

In [188]:
# this is where the DataConnector Object is made
data_connector = dc.DataConnector(filename="data.sqlite")

In [189]:
data_connector.conn

In [190]:
table_names = data_connector.get_table_names()
table_names

['orderdetails',
 'payments',
 'offices',
 'customers',
 'orders',
 'productlines',
 'products',
 'employees',
 'contacts',
 'contacts2']

In [191]:
payments_df = data_connector.load_table_as_df(table_name="payments")

In [192]:
payments_df.head()

  customerNumber checkNumber paymentDate    amount
0            103    HQ336336  2004-10-19   6066.78
1            103    JM555205  2003-06-05  14571.44
2            103    OM314933  2004-12-18   1676.14
3            112    BO864823  2004-12-17  14191.12
4            112     HQ55022  2003-06-06  32641.98

In [193]:
# So we've built our dataconnector class.  
# The next step is to build a specific class for a specific table

In [194]:
payment_connector = dc.PaymentsConnector(filename="data.sqlite")

In [195]:
payment_connector.table_name

'payments'

In [196]:
payment_connector.get_table_names()

['orderdetails',
 'payments',
 'offices',
 'customers',
 'orders',
 'productlines',
 'products',
 'employees',
 'contacts',
 'contacts2']

In [197]:
payment_connector.load_df()

    customerNumber checkNumber paymentDate    amount
0              103    HQ336336  2004-10-19   6066.78
1              103    JM555205  2003-06-05  14571.44
2              103    OM314933  2004-12-18   1676.14
3              112    BO864823  2004-12-17  14191.12
4              112     HQ55022  2003-06-06  32641.98
..             ...         ...         ...       ...
268            495    BH167026  2003-12-26  59265.14
269            495    FN155234  2004-05-14   6276.60
270            496    EU531600  2005-05-25  30253.75
271            496    MB342426  2003-07-16  32077.44
272            496     MN89921  2004-12-31  52166.00

[273 rows x 4 columns]

In [198]:
payment_connector.find_customers()

  customerNumber checkNumber paymentDate    amount
0            103    HQ336336  2004-10-19   6066.78
1            103    JM555205  2003-06-05  14571.44
2            103    OM314933  2004-12-18   1676.14

In [199]:
query = "select * from payments where customerNumber = '103'"
conn.execute(query).fetchall()

[('103', 'HQ336336', '2004-10-19', '6066.78'),
 ('103', 'JM555205', '2003-06-05', '14571.44'),
 ('103', 'OM314933', '2004-12-18', '1676.14')]

In [200]:
from sklearn.linear_model import LinearRegression

In [ ]:
ols = LinearRegression()